## 1. Import libraries and set-up SQL engine

In [1]:
from sqlalchemy import create_engine, text

import pandas as pd


DATABASE_PATH = "database/student.db"
ENGINE = create_engine(f"sqlite:///{DATABASE_PATH}")

def sql(query: str, engine) -> pd.DataFrame:
    with engine.connect() as conn:
        return pd.read_sql_query(text(query), conn)

## 3. Apply SQL commands from database

In [3]:
query = "SELECT * FROM STUDENT_NAMES;"
sql(query, engine=ENGINE)

   id first_name last_name  gpa  major
0   1       John     Smith  90%    SPY
1   2      Carol   Danvers  80%  PILOT
2   3       Tony     Stark  80%    ENG
3   4       John  Travolta  75%  ACTOR
4   5     Maggie     Smith  95%  ACTOR

In [4]:
query = "SELECT * FROM STUDENT_GRADES;"
sql(query, engine=ENGINE)

   id    term grade
0   2  Spring   85%
1   2    Fall   90%
2   3    Fall   80%

In [5]:
query = "SELECT * FROM STUDENT_DEGREES;"
sql(query, engine=ENGINE)

   id degree
0   2   BSc.
1   3   BSc.
2   3   MSc.

In [11]:
# EXERCISE 1: GET LIST OF NAMES OF ACTORS

query = "SELECT first_name, last_name FROM STUDENT_NAMES WHERE major = 'ACTOR' "
sql(query, engine = ENGINE)

  first_name last_name
0       John     Smith
1      Carol   Danvers
2       Tony     Stark
3       John  Travolta
4     Maggie     Smith

In [25]:
# EXERCISE 2: CREATE A TABLE WITH THE FOLLOWING SCHEMA:
# |degree|major|avg_grade|

query = '''SELECT 
    b.degree AS Degree, 
    a.major AS Major, 
    AVG(c.grade) AS Average_Grade 
FROM STUDENT_NAMES a 
INNER JOIN STUDENT_DEGREES b ON a.id = b.id 
INNER JOIN STUDENT_GRADES c on c.id = b.id

GROUP BY b.id
'''
sql(query, engine = ENGINE)

  Degree  Major  Average_Grade
0   BSc.  PILOT           87.5
1   BSc.    ENG           80.0

In [7]:
# EXERCISE 3: CREATE A TABLE WITH THE FOLLOWING SCHEMA:
# full_name | major | avg_gpa | n_degrees|
# Note: full name = first_name last_name (e.g., John Smith)

In [32]:
query = '''
SELECT CONCAT(a.first_name, " ", a.last_name) AS full_name, a.major, AVG(a.gpa) as avg_gpa, COUNT(b.degree) AS n_degrees
FROM STUDENT_NAMES a
LEFT JOIN STUDENT_DEGREES b ON a.id = b.id 
LEFT JOIN STUDENT_GRADES c on c.id = b.id

GROUP BY b.id
'''

sql(query, engine = ENGINE)

       full_name  major    avg_gpa  n_degrees
0     John Smith    SPY  86.666667          0
1  Carol Danvers  PILOT  80.000000          2
2     Tony Stark    ENG  80.000000          2